package com.bdaim.customs.dto;

/**
 * @author chengning@salescomm.net
 * @date 2019-11-26 14:52
 */
public enum BgdSendStatusEnum {

    B0("B0","未申报"),
    B1("B1","报文已生成"),
    D0("D0","中心入库成功"),
    D1("D1","中心入库失败"),
    D2("D2","发往海关成功"),
    D3("D3","发往海关失败"),
    Y("Y","新增、修改、追加成功"),
    N("N","新增、修改、追加失败"),
    A("A","允许追加"),
    R("R","不允许追加"),
    BACK("00","退单"),
    _02("02","转普货报关"),
    _03("03","转人工审核"),
    _04("04","请提交纸面单据"),
    _05("05","查验"),
    _06("06","扣留"),
    _07("07","没收"),
    _08("08","改单"),
    D("D","删单"),
    _10("10","审核通过"),
    _11("11","放行"),
    _12("12","查验后补税放行"),
    _13("13","查验后补证放行"),
    _14("14","查验后补税补证放行"),
    _15("15","查验后处罚后放"),
    _16("16","查验后改单放行"),
    _17("17","查验后担保放行"),
    _18("18","查验正常货物放行"),
    _19("19","查验后扣留"),
    _20("20","查验后退单"),
    _21("21","查验后转普货报关"),
    _22("22","查验后转A、C类报关"),
    _23("23","查验后转个人物品报关"),
    _24("24","查验后改单"),
    _25("25","退单未申报");

    private String code;
    private String name;

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    BgdSendStatusEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }
}
